config.org
** Linting with Flycheck
   #+begin_src emacs-lisp :tangle yes
     (use-package flycheck
       :config
       (global-set-key (kbd "C-c h f")
                       (defhydra hydra-flycheck
                         (:pre (progn (validate-setq hydra-lv t) (flycheck-list-errors))
                               :post (progn (validate-setq hydra-lv nil) (quit-windows-on "*Flycheck errors*"))
                               :hint nil)
                         "Errors"
                         ("f"  flycheck-error-list-set-filter                            "Filter")
                         ("n"  flycheck-next-error                                       "Next")
                         ("p"  flycheck-previous-error                                   "Previous")
                         ("<" flycheck-first-error                                      "First")
                         (">"  (progn (goto-char (point-max)) (flycheck-previous-error)) "Last")
                         ("q"  nil)))
       (use-package flycheck-pos-tip
         :config (flycheck-pos-tip-mode))
       (add-hook 'prog-mode-hook 'global-flycheck-mode))
   #+end_src
** Templating with Yasnippet
   #+begin_src emacs-lisp :tangle yes
  (use-package yasnippet
    :diminish yas-global-mode yas-minor-mode
    :init (add-hook 'after-init-hook 'yas-global-mode)
    :config (validate-setq yas-snippet-dirs '("~/.emacs.d/snippets/")))
   #+end_src
** Autocompletions with Company
   #+begin_src emacs-lisp :tangle yes
     (use-package company
       :diminish company-mode
       :init
       (add-hook 'after-init-hook 'global-company-mode)
       :config
       (require 'company-dabbrev)
       (validate-setq company-dabbrev-ignore-case nil
                      company-dabbrev-code-ignore-case nil
                      company-dabbrev-downcase nil
                      company-idle-delay 0
                      company-begin-commands '(self-insert-command)
                      company-transformers '(company-sort-by-occurrence))
       (use-package company-quickhelp
         :config (company-quickhelp-mode 1)))
   #+end_src
** Spellcheck with Flyspell
   #+begin_src emacs-lisp :tangle yes
  (use-package flyspell 
    :ensure f 
    :diminish flyspell-mode
    :init
    (setenv "DICTIONARY" "en_GB")
    :config   
    (add-hook 'markdown-mode-hook 'flyspell-mode))
   #+end_src
* Language Support
** Direnv
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package direnv
    :config
    (direnv-mode)
    (validate-setq direnv-always-show-summary t))
#+END_SRC
** Common Lisp
   #+BEGIN_SRC emacs-lisp :tangle yes
     (use-package slime
       :config
       (validate-setq inferior-lisp-program "sbcl")
       (validate-setq slime-contribs '(slime-fancy))
       (use-package slime-company
         :config
         (slime-setup '(slime-company))))
   #+END_SRC
** Emacs Lisp
   #+begin_src emacs-lisp :tangle yes
  (bind-key "C-c C-k" 'eval-buffer emacs-lisp-mode-map)
   #+end_src
** Nix
   #+BEGIN_SRC emacs-lisp :tangle yes
  (use-package nix-mode
    :config
    (add-hook 'nix-mode-hook (lambda ()
                               (aggressive-indent-mode -1))))
   #+END_SRC
*** completion
    #+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-nixos-options
    :config
    (add-to-list 'company-backends 'company-nixos-options))
    #+END_SRC
** Go
   #+begin_src emacs-lisp :tangle yes
(use-package go-mode
  :mode ("\\.go\\'" . go-mode)
  :config (progn
            (add-hook 'go-mode-hook 'compilation-auto-quit-window)
            (add-hook 'go-mode-hook (lambda ()
                                      (set (make-local-variable 'company-backends) '(company-go))
                                      (company-mode)))
            (add-hook 'go-mode-hook (lambda ()
                                      (add-hook 'before-save-hook 'gofmt-before-save)
                                      (local-set-key (kbd "M-.") 'godef-jump)))
            (add-hook 'go-mode-hook
                      (lambda ()
                        (unless (file-exists-p "Makefile")
                          (set (make-local-variable 'compile-command)
                               (let ((file (file-name-nondirectory buffer-file-name)))
                                 (format "go build %s"
                                         file))))))
            (use-package go-dlv
              :config (require 'go-dlv))
            (use-package golint
              :config
              (add-to-list 'load-path (concat (getenv "GOPATH")  "/src/github.com/golang/lint/misc/emacs"))
              (require 'golint))
            (use-package gorepl-mode
              :config (add-hook 'go-mode-hook #'gorepl-mode))
            (use-package company-go
              :config (add-hook 'go-mode-hook (lambda ()
                                                (set (make-local-variable 'company-backends) '(company-go))
                                                (company-mode))))))
   #+end_src
** C
   #+BEGIN_SRC emacs-lisp :tangle no
  (add-hook 'c-mode-hook
            (lambda ()
              (unless (file-exists-p "Makefile")
                (set (make-local-variable 'compile-command)
                     (let ((file (file-name-nondirectory buffer-file-name)))
                       (format "cc -Wall %s -o %s --std=c99"
                               file
                               (file-name-sans-extension file)))))))
   #+END_SRC
** C++
*** C++ compile function
    #+begin_src emacs-lisp :tangle yes
(add-hook 'c++-mode-hook
          (lambda ()
            (unless (file-exists-p "Makefile")
              (set (make-local-variable 'compile-command)
                   (let ((file (file-name-nondirectory buffer-file-name)))
                     (format "g++ -Wall -s -pedantic-errors %s -o %s --std=c++14"
                             file
                             (file-name-sans-extension file)))))))
    #+end_src
** Fish
   #+begin_src emacs-lisp :tangle yes
  (use-package fish-mode
    :mode ("\\.fish\\'" . fish-mode)
    :init (add-hook 'fish-mode-hook
                    (lambda () (aggressive-indent-mode -1))))
   #+end_src
** Rust
   #+begin_src emacs-lisp :tangle yes
(use-package rust-mode
  :mode ("\\.rs\\'" . rust-mode))
   #+end_src
** Python
*** Disabling aggressive-indent-mode
#+BEGIN_SRC emacs-lisp :tangle yes
  (add-hook 'python-mode-hook (lambda () (aggressive-indent-mode -1)))
#+END_SRC
*** Python path
#+BEGIN_SRC emacs-lisp :tangle yes
  (eval-after-load "python-mode"
    (lambda ()
      (validate-setq python-remove-cwd-from-path t)))
#+END_SRC
*** Sphinx Docs
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package sphinx-doc
    :init
    (add-hook 'python-mode-hook (lambda ()
                                  (sphinx-doc-mode 1))))
#+END_SRC
*** Anaconda
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package anaconda-mode
    :init
    (add-hook 'python-mode-hook 'anaconda-mode)
    (add-hook 'python-mode-hook 'anaconda-eldoc-mode))
#+END_SRC
**** Company
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package company-anaconda
    :config
    (eval-after-load "company"
      '(add-to-list 'company-backends '(company-anaconda))))
#+END_SRC
*** isort
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package py-isort
    :defer t
    :init
    (add-hook 'before-save-hook 'py-isort-before-save))
#+END_SRC
*** yapfify
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package yapfify 
    :init
    (add-hook 'python-mode-hook 'yapf-mode))
#+END_SRC
*** Autopep8
    #+BEGIN_SRC emacs-lisp :tangle yes
  (use-package py-autopep8
    :init
    (add-hook 'python-mode-hook 'py-autopep8-enable-on-save))
    #+END_SRC
*** Pyvenv
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pyvenv)
#+END_SRC
*** Pytest
#+BEGIN_SRC emacs-lisp :tangle yes
  (use-package pytest
    :bind (:map python-mode-map
                ("C-c a" . pytest-all)
                ("C-c m" . pytest-module)
                ("C-c ." . pytest-one)
                ("C-c d" . pytest-directory)
                ("C-c p a" . pytest-pdb-all)
                ("C-c p m" . pytest-pdb-module)
                ("C-c p ." . pytest-pdb-one)))
#+END_SRC
*** Elpy (Disabled)
    #+begin_src emacs-lisp :tangle no
  (use-package elpy
    :init
    (add-hook 'python-mode-hook (lambda () (aggressive-indent-mode -1)))
    (add-hook 'python-mode-hook 'elpy-mode)
    :config
    (when (require 'flycheck nil t)
      (remove-hook 'elpy-modules 'elpy-module-flymake)
      (remove-hook 'elpy-modules 'elpy-module-yasnippet)
      (remove-hook 'elpy-mode-hook 'elpy-module-highlight-indentation)
      (add-hook 'elpy-mode-hook 'flycheck-mode))
    (elpy-enable))
#+end_src

** HTML
*** Web-mode
    #+begin_src emacs-lisp :tangle yes
   (use-package web-mode
     :mode (("\\.html\\'" . web-mode)
            ("\\.html\\.erb\\'" . web-mode)
            ("\\.mustache\\'" . web-mode)
            ("\\.jinja\\'" . web-mode)
            ("\\.njk\\'" . web-mode)
            ("\\.php\\'" . web-mode))
     :config
     (validate-setq web-mode-enable-css-colorization t)
     (validate-setq web-mode-code-indent-offset 2)
     (validate-setq web-mode-markup-indent-offset 2))
    #+end_src
*** Emmet-mode
    #+begin_src emacs-lisp :tangle yes
(use-package emmet-mode
  :diminish emmet-mode
  :config
  (add-hook 'web-mode-hook 'emmet-mode)
  (add-hook 'vue-mode-hook 'emmet-mode))
    #+end_src
** CSS
*** Rainbow-mode
    #+begin_src emacs-lisp :tangle no
   (use-package rainbow-mode
     :diminish rainbow-mode
     :config
     (add-hook 'css-mode-hook 'rainbow-mode)
     (add-hook 'scss-mode-hook 'rainbow-mode))
    #+end_src
