config.el

(add-hook 'org-mode-hook (lambda ()
                           (auto-fill-mode 1)))

(validate-setq org-agenda-files (file-expand-wildcards "~/.org/gtd/[a-zA-z]*.org"))

(defvar jethro/delete-frame-after-capture nil
  "Whether to delete the last frame after the current capture")

(defun jethro/delete-frame-if-neccessary (&rest r)
  (if (or (equal "capture" (frame-parameter nil 'name))
          jethro/delete-frame-after-capture)
      (progn
        (validate-setq jethro/delete-frame-after-capture nil)
        (delete-frame))
    (validate-setq jethro/delete-frame-after-capture nil)))

(defadvice org-switch-to-buffer-other-window
    (after supress-window-splitting activate)
  "Delete the extra window if we're in a capture frame"
  (if (equal "capture" (frame-parameter nil 'name))
      (delete-other-windows)))

(defun make-capture-frame ()
  "Create a new frame and run org-capture."
  (interactive)
  (select-frame
   (make-frame '((window-system . x)
                 (name . "capture")
                 (width . 120)
                 (height . 15)))) 
  (validate-setq word-wrap 1)
  (validate-setq truncate-lines nil)
  (validate-setq jethro/delete-frame-after-capture t)
  (org-capture nil "t"))

(advice-add 'org-capture-finalize :after 'jethro/delete-frame-if-neccessary)
(advice-add 'org-capture-kill :after 'jethro/delete-frame-if-neccessary)
(advice-add 'org-capture-refile :after 'jethro/delete-frame-if-neccessary)

; Targets include this file and any file contributing to the agenda - up to 9 levels deep
(validate-setq org-refile-targets (quote ((nil :maxlevel . 9)
                                 (org-agenda-files :maxlevel . 9))))

; Use full outline paths for refile targets - we file directly with IDO
(validate-setq org-refile-use-outline-path t)

; Targets complete directly with IDO
(validate-setq org-outline-path-complete-in-steps nil)

; Allow refile to create parent tasks with confirmation
(validate-setq org-refile-allow-creating-parent-nodes 'confirm)

(validate-setq org-completion-use-ido t)

;;;; Refile settings
(defun jethro/verify-refile-target ()
  "Exclude todo keywords with a done state from refile targets"
  (not (member (nth 2 (org-heading-components)) org-done-keywords)))

(validate-setq org-refile-target-verify-function 'jethro/verify-refile-target)
