config.org
**** Automatically removing context based tasks with / RET
     :PROPERTIES:
     :CUSTOM_ID: CustomAgendaViewFilteringContext
     :END:

 =/ RET= in the agenda is really useful.  This awesome feature was
 added to org-mode by John Wiegley.  It removes tasks automatically by
 filtering based on a user-provided function.

 At work I have projects I'm working on which are assigned by my
 manager.  Sometimes priorities changes and projects are delayed to
 sometime in the future.  This means I need to stop working on these
 immediately.  I put the project task on =HOLD= and work on something
 else.  The =/ RET= filter removes =HOLD= tasks and subtasks (because
 of tag inheritance).

 At home I have some tasks tagged with =farm= since these need to be
 performed when I am physically at our family farm.  Since I am there
 infrequently I have added =farm= to the list of auto-excluded tags on
 my system.  I can always explicitly filter to just =farm= tasks with
 =/ TAB farm RET= when I am physically there.

 I have the following setup to allow =/ RET= to filter tasks based on
 the description above.

 #+header: :tangle yes
 #+begin_src emacs-lisp
 (defun bh/org-auto-exclude-function (tag)
   "Automatic task exclusion in the agenda with / RET"
   (and (cond
         ((string= tag "hold")
          t)
         ((string= tag "farm")
          t))
        (concat "-" tag)))

 (validate-setq org-agenda-auto-exclude-function 'bh/org-auto-exclude-function)
 #+end_src

 This lets me filter tasks with just =/ RET= on the agenda which removes tasks I'm not
 supposed to be working on now from the list of returned results.

 This helps to keep my agenda clutter-free.
** Tags
   :PROPERTIES:
   :CUSTOM_ID: Tags
   :END:

 Tasks can have any number of arbitrary tags.  Tags are used for:

 - filtering todo lists and agenda views
 - providing context for tasks
 - tagging notes
 - tagging phone calls
 - tagging meetings
 - tagging tasks to be refiled
 - tagging tasks in a WAITING state because a parent task is WAITING
 - tagging cancelled tasks because a parent task is CANCELLED
 - preventing export of some subtrees when publishing

 I use tags mostly for filtering in the agenda.  This means you can
 find tasks with a specific tag easily across your large number of
 org-mode files.

*** Tags
    :PROPERTIES:
    :CUSTOM_ID: OrgTagAlist
    :END:

 Here are my tag definitions with associated keys for filtering in the
 agenda views.

 The startgroup - endgroup (=@XXX=) tags are mutually exclusive -
 selecting one removes a similar tag already on the task.  These are
 the context tags - you can't be in two places at once so if a task is
 marked with @farm and you add @office then the @farm tag is removed
 automagically.

 The other tags =WAITING= .. =FLAGGED= are not mutually exclusive and
 multiple tags can appear on a single task.  Some of those tags are
 created by todo state change triggers.  The shortcut key is used to
 add or remove the tag using =C-c C-q= or to apply the task for
 filtering on the agenda.

 I have both =FARM= and =@farm= tags.  =FARM= is set by a =FILETAGS=
 entry and just gives me a way to filter anything farm related.  The
 =@farm= tag signifies that the task as to be done /at the farm/.  If I
 have to call someone about something that would have a =FARM= tag but
 I can do that at home on my lunch break.  I don't physically have to
 be at the farm to make the call.

 #+header: :tangle yes
 #+begin_src emacs-lisp
   ; Tags with fast selection keys
   (validate-setq org-tag-alist (quote ((:startgroup)
                               ("@errand" . ?e)
                               ("@office" . ?o)
                               ("@home" . ?H)
                               ("@farm" . ?f)
                               (:endgroup)
                               ("WAITING" . ?w)
                               ("HOLD" . ?h)
                               ("PERSONAL" . ?P)
                               ("WORK" . ?W)
                               ("FARM" . ?F)
                               ("ORG" . ?O)
                               ("NORANG" . ?N)
                               ("crypt" . ?E)
                               ("NOTE" . ?n)
                               ("CANCELLED" . ?c)
                               ("FLAGGED" . ??))))

   ; Allow setting single tags without the menu
   (validate-setq org-fast-tag-selection-single-key (quote expert))

   ; For tag searches ignore tasks with scheduled and deadline dates
   (validate-setq org-agenda-tags-todo-honor-ignore-options t)
 #+end_src
*** Filetags
    :PROPERTIES:
    :CUSTOM_ID: FileTags
    :END:

 Filetags are a convenient way to apply one or more tags to all of the
 headings in a file.

 Filetags look like this:

 #+begin_src org :exports src
 ,#+FILETAGS: NORANG @office
 #+end_src

 I have the following =#+FILETAGS:= entries in my org-mode files:
**** Non-work related org-mode files
     :PROPERTIES:
     :CUSTOM_ID: TaggingNonWorkFiles
     :END:

 | File         | Tags                  |
 |--------------+-----------------------|
 | todo.org     | PERSONAL              |
 | gsoc2009.org | GSOC PERSONAL         |
 | git.org      | GIT WORK              |
 | org.org      | ORG WORK              |
 | mark.org     | MARK PERSONAL         |
 | farm.org     | FARM PERSONAL         |
**** Work related org-mode files
     :PROPERTIES:
     :CUSTOM_ID: TaggingWorkFiles
     :END:

 | File        | Tags            |
 |-------------+-----------------|
 | norang.org  | NORANG @office  |
 | ABC.org     | ABC @office     |
 | XYZ.org     | XYZ @office     |
 | ABC-DEF.org | ABC DEF @office |
 | ABC-KKK.org | ABC KKK @office |
 | YYY.org     | YYY @office     |
**** Refile tasks
     :PROPERTIES:
     :CUSTOM_ID: RefileTasks
     :END:

 | File       | Tags         |
 |------------+--------------|
 | refile.org | REFILE       |
 |------------+--------------|
*** State Trigger Tags
    :PROPERTIES:
    :CUSTOM_ID: StateTriggerTags
    :END:

 The following tags are automatically added or removed by todo state
 triggers described previously in [[#ToDoStateTriggers][ToDo state triggers]]

 - =WAITING=
   - =CANCELLED=
** GTD stuff
   :PROPERTIES:
   :CUSTOM_ID: GTD
   :
 Most of my day is deadline/schedule driven.
 I work off of the agenda first and then pick items from the todo lists as
 outlined in [[#WhatDoIWorkOnNext][What do I work on next?]]
*** Weekly Review Process
    :PROPERTIES:
    :CUSTOM_ID: GTDWeeklyReview
    :END:

 The first day of the week (usually Monday) I do my weekly review. 
 I keep a list like this one to remind me what needs to be done.

 To keep the agenda fast I set
 #+header: :tangle yes
 #+begin_src emacs-lisp
 (validate-setq org-agenda-span 'day)
 #+end_src
 so only today's date is shown by default.  I only need the weekly
 view during my weekly review and this keeps my agenda generation
 fast.

 I have a recurring task which keeps my weekly review checklist
 handy.  This pops up as a reminder on Monday's.  This week I'm
 doing my weekly review on Tuesday since Monday was a holiday.

 #+begin_src org :exports src
 ,* NEXT Weekly Review [0/6]
   SCHEDULED: <2009-05-18 Mon ++1w> 
   :LOGBOOK:...
   :PROPERTIES:...

   What to review:

    - [ ] Check follow-up folder
    - [ ] Review weekly agenda =F12 a w //=
    - [ ] Check clocking data for past week =v c=
    - [ ] Review clock report for past week =R=
      - Check where we spent time (too much or too little) and rectify this week
    - [ ] Look at entire agenda for today  =F12 SPC=
    - [ ] Review projects =F12 SPC //= and =V= repeatedly to view each project

    - start work
      - daily agenda first - knock off items
      - then work on NEXT tasks
 #+end_src
 The first item [ ] Check follow-up folder makes me pull out the paper
 file I dump stuff into all week long - things I need to take care of
 but are in no particular hurry to deal with.  Stuff I get in the mail
 etc. that I don't want to deal with now.  I just toss it in my
 =Follow-Up= folder in the filing cabinet and forget about it until the
 weekly review.

 I go through the folder and weed out anything that needs to be dealt
 with.  After that everything else is in =org-mode=.  I tend to
 schedule tasks onto the agenda for the coming week so that I don't
 spend lots of time trying to find what needs to be worked on next.

 This works for me.  Your mileage may vary ;)
